linux/tutorials/install/huawei-ec122/huawei-ec122.org
#+TITLE: Using Huawei EC122 Dongle With Debian Sid
#+DATE: <2014-12-29 Mon>
#+AUTHOR: Xiaolin Wang
#+EMAIL: wx672ster@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.4.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

* Setup
** Install
   Before installing anything, you should plug your USB stick in, and check it's vendor
   and product codes
   : lsusb
   You should see the codes =12d1:1505= for EC122. And it perhaps show you that it's a
   E398. Don't know why.

   Now, you should install =usb_modeswitch= and =wvdial=
   : sudo aptitude install usb_modeswitch wvdial
   
** =usb_modeswitch= config
   1. =/etc/usb_modeswitch.d/12d1:1505=
      : cd /tmp
      : tar zxf /usr/share/usb_modeswitch/configPack.tar.gz
      : sudo cp 12d1\:1505 /etc/usb_modeswitch.d/
   2. Switching working mode (This step is not needed)
      : usb_modeswitch -W -I -v 12d1 -p 1505 -M 55534243123456780000000000000011062000000101000100000000000000
      The product code should switch from =1505= to =140c=. This command is usually not
      needed since the switching job should be done automatically. And you should see
      =ttyUSB*= in =/dev=. This means the modem is ready!

** =wvdial= config
   1. =wvdialconf=
      : sudo wvdialconf
      Now, you have to edit =/etc/wvdial.conf= manually to fill in =phone=, =username=, and
      =password=. If your ISP is China Telecom, you can try
      - phone: =#777=
      - username: =ctnet@mycdma.cn=
      - password: =vnet.mobi=

* Use

  Easy. Whenever you want to connect to the Internet,
  1. Plug your USB dongle into your laptop
  2. =wvdial= to connect to the internet
     : sudo wvdial
  3. Enjoy!



  
