linux/tutorials/install/huawei-ec122/huawei-ec122.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Using Huawei EC122 Dongle With Debian Sid</title>
<!-- 2014-12-29 Mon 11:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xiaolin Wang" />
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Using Huawei EC122 Dongle With Debian Sid</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Setup</a>
<ul>
<li><a href="#sec-1-1">1.1. Install</a></li>
<li><a href="#sec-1-2">1.2. <code>usb_modeswitch</code> config</a></li>
<li><a href="#sec-1-3">1.3. <code>wvdial</code> config</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Use</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Install</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Before installing anything, you should plug your USB stick in, and check it's vendor
and product codes
</p>
<pre class="example">
lsusb
</pre>
<p>
You should see the codes <code>12d1:1505</code> for EC122. And it perhaps show you that it's a
E398. Don't know why.
</p>

<p>
Now, you should install <code>usb_modeswitch</code> and <code>wvdial</code>
</p>
<pre class="example">
sudo aptitude install usb_modeswitch wvdial
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <code>usb_modeswitch</code> config</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><code>/etc/usb_modeswitch.d/12d1:1505</code>
<pre class="example">
cd /tmp
tar zxf /usr/share/usb_modeswitch/configPack.tar.gz
sudo cp 12d1\:1505 /etc/usb_modeswitch.d/
</pre>
</li>
<li>Switching working mode (This step is not needed)
<pre class="example">
usb_modeswitch -W -I -v 12d1 -p 1505 -M 55534243123456780000000000000011062000000101000100000000000000
</pre>
<p>
The product code should switch from <code>1505</code> to <code>140c</code>. This command is usually not
needed since the switching job should be done automatically. And you should see
<code>ttyUSB*</code> in <code>/dev</code>. This means the modem is ready!
</p>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <code>wvdial</code> config</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><code>wvdialconf</code>
<pre class="example">
sudo wvdialconf
</pre>
<p>
Now, you have to edit <code>/etc/wvdial.conf</code> manually to fill in <code>phone</code>, <code>username</code>, and
<code>password</code>. If your ISP is China Telecom, you can try
</p>
<ul class="org-ul">
<li>phone: <code>#777</code>
</li>
<li>username: <code>ctnet@mycdma.cn</code>
</li>
<li>password: <code>vnet.mobi</code>
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Use</h2>
<div class="outline-text-2" id="text-2">
<p>
Easy. Whenever you want to connect to the Internet,
</p>
<ol class="org-ol">
<li>Plug your USB dongle into your laptop
</li>
<li><code>wvdial</code> to connect to the internet
<pre class="example">
sudo wvdial
</pre>
</li>
<li>Enjoy!
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-12-29 Mon&gt;</span></span></p>
<p class="author">Author: Xiaolin Wang</p>
<p class="date">Created: 2014-12-29 Mon 11:06</p>
<p class="creator">Emacs 24.4.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
